feat: added visual styling to flows
